<?php

namespace Database\Seeders;

use App\Models\Question;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class QuestionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $questions = [
            ['question' => ' هل ينشغل الطفل بلعبة معينة بصورة غير عادية ويترك باقي الألعاب؟  ', 'category_id' =>'1'],
            ['question' =>
            ' هل يستخدم الطفل الألعاب بطريقة نمطية بصورة متكررة مثل(البدء بلعبة المكعبات ثم السيارة ثم الكرة وإذا كانت المكعبات غير موجودة لا يستطيع بدء اللعب)؟  ', 'category_id' =>'1'],
            ['question' =>
             ' هل يستمر الطفل في عمل سلوكيات محددة إذا ترك بمفرده أو يقوم بتصرفات غريبة في العامة لجذب الأنتباه؟  ', 'category_id' =>'1'],
            ['question' =>
             ' هل يتبع الطفل سلوكيات بطقوس معينة مثل(إذا طلبت الأم من الطفل إعداد السفرة معها يبدأ بوضع الطبق ثم الشوكة ثم السكين وفي كل مره يبدأ بنفس النمط الطبق ثم الشوكة ثم السكين)؟  ', 'category_id' =>'1'],
            ['question' => ' هل يقوم الطفل بالرفرفة بيده إلي الأمام أو الجانبين؟  ', 'category_id' =>'1'],
            ['question' => ' هل يصدر الطفل أصوات حادة مثل (إييي)؟ ', 'category_id' =>'1'],

            ['question' => ' هل يعجز الطفل عن بدء الحديث مع الأخرين؟  ', 'category_id' =>'2'],
            ['question' => ' هل الطفل غير قادرعلي تقليد الأشخاص مثلا(إذا قمت بالتسقيف وطلبت من الطفل تقليد الحركة لا يستطيع)؟  ', 'category_id' =>'2'],
            ['question' => ' هل يظهر الطفل سعادة محدودة عند التفاع مثل(يشعر بإنذعاج إذا تحدث معه أحد أو يظهر عدم إهتمام بالحديث)؟  ', 'category_id' =>'2'],
            ['question' => ' هل يفشل الطفل في تكوين صداقات أو الحفاظ عليها؟  ', 'category_id' =>'2'],
            ['question' => ' هل يظهر الطفل إهتمام محدود للأخرين أو يتجاهل وجود الأشخاص ؟  ', 'category_id' =>'2'],
            ['question' => ' هل يبدي الطفل عدم إستجابة عندما يحاول الأخرين التفاعل معه؟ ', 'category_id' =>'2'],

            ['question' => ' هل يقوم الطفل بترديد الكلام بشكل متكرر (إذا ناديت الطفل قائلا :"يا محمد" , سيجيب قائلا :"نعم ,نعم ,نعم" , أو ربما يقول :"نعم" , ثم عندما تبدأ بالحديث معه يكرر الرد بـ"نعم" مرة أخر)؟  ', 'category_id' =>'3'],
            ['question' => ' هل تلاحظ أن الطفل لا يفهم كثير من الكلمات عند الحديث معه؟  ', 'category_id' =>'3'],
            ['question' => ' هل يفتقر الطفل إلى الوعي بالضمائر، فيخاطب المذكر بصيغة المؤنث والمؤنث بصيغة المذكر؟ ', 'category_id' =>'3'],
            ['question' => ' هل تلاحظ أن الطفل لا يستطيع فهم المغزى من الحديث أو استيعاب نوايا المتحدث؟ ', 'category_id' =>'3'],
            ['question' => ' هل تلاحظ أن الطفل لا ينتظر دوره في الحديث، ويقاطع الكلم أحيانا ليقول أمورا لا علقة لها بالموضوع؟  ', 'category_id' =>'3'],
            ['question' => ' هل يفتقر الطفل إلى فهم تعبيرات الوجه لدى الأشخاص، مثل التعرف على الحزن أو السعادة؟  ', 'category_id' =>'3'],
            ['question' => ' هل يستطيع الطفل إبداء تعبيرات وجهية تعكس مشاعره (الفرح أو الحزن)؟ ', 'category_id' =>'3'],

            ['question' => ' هل يستطيع الطفل إرتداء ملابسه بمفرده؟  ', 'category_id' =>'4'],
            ['question' => ' هل الطفل يقوم بغسل يديه (مثلا بعد تناول الطعام)؟  ', 'category_id' =>'4'],
            ['question' => ' هل يعتني الطفل بنظافته الشخصية ؟  ', 'category_id' =>'4'],
            ['question' => ' هل الطفل قادر علي إدراك الوقت أو المال؟  ', 'category_id' =>'4'],
            ['question' => ' هل الطفل غير قادر علي التنقل بمفرده؟  ', 'category_id' =>'4'],
            ['question' => ' هل تلاحظ أن الطفل لا يستطيع الأستقللية في أغلب الأمور؟  ', 'category_id' =>'4'],
            ['question' => ' هل تلاحظ أن الطفل معتمد علي الأخرين بشكل كلي؟ ', 'category_id' =>'4'],

            ['question' => ' هل تلاحظ أن الطفل لا يستطيع التنقل ببصره بين شيئين مثل(النظر إلي لعبة ثم النظر إلي لعبة آخري)؟  ', 'category_id' =>'5'],
            ['question' => ' هل تلاحظ أن الطفل لا يستطيع التنقل ببصره بين شخص وشيء مثل(النظر إلي شخص ثم النظر إلي لعبة)؟  ', 'category_id' =>'5'],
            ['question' =>
             ' هل تلاحظ أن الطفل لا يستطيع التنقل ببصره بين شخص وشيئين مثل( النظر إلي لعبة ثم النظر إلي شخص ثم النظر إلي اللعبة مره آخري)؟  ', 'category_id' =>'5'],
            ['question' => ' هل تلاحظ أن الطفل لا يستطيع النظر في عينيك أثناء حديثك معه إلا ثواني معدوده؟  ', 'category_id' =>'5'],
            ['question' => ' هل تلاحظ أنه إذا حدث أي شيء بسيط قد يخرج الطفل من تركيزه ويصيبه بتشتت الانتباه مثلا (إذا كان يكتب، فيترك القلم)؟  ', 'category_id' =>'5'],
            ['question' => ' (هل تلاحظ أن الطفل غير منتبه للأشياء المحيطة به مثال( قد يكون جائعا والطعام بجانبه، لكنه غير مدرك لذلك', 'category_id' =>'5'],

        ];
        foreach ($questions as $question) {
            Question::create($question);
        }
    }
}
